The elements you have selected for grouping contain dimensions or tags which do not reference a common model group. No detail group has been created.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateGroupWithInvalidReferences { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateGroupWithInvalidReferences As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateGroupWithInvalidReferences {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace